load-test.txt
$ npx artillery quick --count 10 -n 20 http://localhost:3000/api/quiz-submit

Log file: artillery_report_20260718_143021.json

Phase 0 starting: 10 virtual users, 20 requests each
-----------------------------------------
Phase 0 completed
-----------------------------------------

--------------------------------
Summary report @ 14:30:25(+0530)
--------------------------------

http.codes.200: ................................................................ 200
http.request_rate: ............................................................. 82/sec
http.requests: ................................................................. 200
http.response_time:
  min: ......................................................................... 12
  max: ......................................................................... 45
  median: ...................................................................... 18
  p95: ......................................................................... 28
  p99: ......................................................................... 35
http.responses: ................................................................ 200
vusers.completed: .............................................................. 10
vusers.created: ................................................................ 10
vusers.created_by_name.0: ...................................................... 10
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 214.3
  max: ......................................................................... 267.1
  median: ...................................................................... 225.4
  p95: ......................................................................... 265.2
  p99: ......................................................................... 267.1

All virtual users finished
Summary report saved to: artillery_report_20260718_143021.json